avrdudes/avr-libc/include/avr/ioavr32db28.h
/* Multiplexer Wiper selector bit group configurations*/
typedef enum OPAMP_OP0RESMUX_MUXWIP_enum
{
    OPAMP_OP0RESMUX_MUXWIP_WIP0_gc = (OPAMP_OP0RESMUX_MUXWIP_WIP0_gv << OPAMP_MUXWIP_gp),  /* R1 = 15R, R2 = 1R, R2/R1 = 0.07 */
    OPAMP_OP0RESMUX_MUXWIP_WIP1_gc = (OPAMP_OP0RESMUX_MUXWIP_WIP1_gv << OPAMP_MUXWIP_gp),  /* R1 = 14R, R2 = 2R, R2/R1 = 0.14 */
    OPAMP_OP0RESMUX_MUXWIP_WIP2_gc = (OPAMP_OP0RESMUX_MUXWIP_WIP2_gv << OPAMP_MUXWIP_gp),  /* R1 = 12R, R2 = 4R, R2/R1 = 0.33 */
    OPAMP_OP0RESMUX_MUXWIP_WIP3_gc = (OPAMP_OP0RESMUX_MUXWIP_WIP3_gv << OPAMP_MUXWIP_gp),  /* R1 = 8R, R2 = 8R, R2/R1 = 1 */
    OPAMP_OP0RESMUX_MUXWIP_WIP4_gc = (OPAMP_OP0RESMUX_MUXWIP_WIP4_gv << OPAMP_MUXWIP_gp),  /* R1 = 6R, R2 = 10R, R2/R1 = 1.67 */
    OPAMP_OP0RESMUX_MUXWIP_WIP5_gc = (OPAMP_OP0RESMUX_MUXWIP_WIP5_gv << OPAMP_MUXWIP_gp),  /* R1 = 4R, R2 = 12R, R2/R1 = 3 */
    OPAMP_OP0RESMUX_MUXWIP_WIP6_gc = (OPAMP_OP0RESMUX_MUXWIP_WIP6_gv << OPAMP_MUXWIP_gp),  /* R1 = 2R, R2 = 14R, R2/R1 = 7 */
    OPAMP_OP0RESMUX_MUXWIP_WIP7_gc = (OPAMP_OP0RESMUX_MUXWIP_WIP7_gv << OPAMP_MUXWIP_gp)   /* R1 = 1R, R2 = 15R, R2/R1 = 15 */
} OPAMP_OP0RESMUX_MUXWIP_t;

/* Output Mode select bit group values */
typedef enum OPAMP_OP1CTRLA_OUTMODE_VALUES_enum
{
    OPAMP_OP1CTRLA_OUTMODE_OFF_gv  = 0x00,  /* Output Driver Off */
    OPAMP_OP1CTRLA_OUTMODE_NORMAL_gv = 0x01   /* Output Driver in Normal Mode */
} OPAMP_OP1CTRLA_OUTMODE_values_t;

/* Output Mode select bit group configurations*/
typedef enum OPAMP_OP1CTRLA_OUTMODE_enum
{
    OPAMP_OP1CTRLA_OUTMODE_OFF_gc  = (OPAMP_OP1CTRLA_OUTMODE_OFF_gv << OPAMP_OUTMODE_gp),  /* Output Driver Off */
    OPAMP_OP1CTRLA_OUTMODE_NORMAL_gc = (OPAMP_OP1CTRLA_OUTMODE_NORMAL_gv << OPAMP_OUTMODE_gp)   /* Output Driver in Normal Mode */
} OPAMP_OP1CTRLA_OUTMODE_t;

/* Negative Input Multiplexer select bit group values */
typedef enum OPAMP_OP1INMUX_MUXNEG_VALUES_enum
{
    OPAMP_OP1INMUX_MUXNEG_INN_gv   = 0x00,  /* Negative input pin for OPn */
    OPAMP_OP1INMUX_MUXNEG_WIP_gv   = 0x01,  /* Wiper from OPn's resistor ladder */
    OPAMP_OP1INMUX_MUXNEG_OUT_gv   = 0x02,  /* OPn output (unity gain) */
    OPAMP_OP1INMUX_MUXNEG_DAC_gv   = 0x03   /* DAC output */
} OPAMP_OP1INMUX_MUXNEG_values_t;

/* Negative Input Multiplexer select bit group configurations*/
typedef enum OPAMP_OP1INMUX_MUXNEG_enum
{
    OPAMP_OP1INMUX_MUXNEG_INN_gc   = (OPAMP_OP1INMUX_MUXNEG_INN_gv << OPAMP_MUXNEG_gp),  /* Negative input pin for OPn */
    OPAMP_OP1INMUX_MUXNEG_WIP_gc   = (OPAMP_OP1INMUX_MUXNEG_WIP_gv << OPAMP_MUXNEG_gp),  /* Wiper from OPn's resistor ladder */
    OPAMP_OP1INMUX_MUXNEG_OUT_gc   = (OPAMP_OP1INMUX_MUXNEG_OUT_gv << OPAMP_MUXNEG_gp),  /* OPn output (unity gain) */
    OPAMP_OP1INMUX_MUXNEG_DAC_gc   = (OPAMP_OP1INMUX_MUXNEG_DAC_gv << OPAMP_MUXNEG_gp)   /* DAC output */
} OPAMP_OP1INMUX_MUXNEG_t;

/* Positive Input Multiplexer select bit group values */
typedef enum OPAMP_OP1INMUX_MUXPOS_VALUES_enum
{
    OPAMP_OP1INMUX_MUXPOS_INP_gv   = 0x00,  /* Positive input pin for OPn */
    OPAMP_OP1INMUX_MUXPOS_WIP_gv   = 0x01,  /* Wiper from OPn's resistor ladder */
    OPAMP_OP1INMUX_MUXPOS_DAC_gv   = 0x02,  /* DAC output */
    OPAMP_OP1INMUX_MUXPOS_GND_gv   = 0x03,  /* Ground */
    OPAMP_OP1INMUX_MUXPOS_VDDDIV2_gv = 0x04,  /* VDD/2 */
    OPAMP_OP1INMUX_MUXPOS_LINKOUT_gv = 0x05   /* Output from OP0 */
} OPAMP_OP1INMUX_MUXPOS_values_t;

/* Positive Input Multiplexer select bit group configurations*/
typedef enum OPAMP_OP1INMUX_MUXPOS_enum
{
    OPAMP_OP1INMUX_MUXPOS_INP_gc   = (OPAMP_OP1INMUX_MUXPOS_INP_gv << OPAMP_MUXPOS_gp),  /* Positive input pin for OPn */
    OPAMP_OP1INMUX_MUXPOS_WIP_gc   = (OPAMP_OP1INMUX_MUXPOS_WIP_gv << OPAMP_MUXPOS_gp),  /* Wiper from OPn's resistor ladder */
    OPAMP_OP1INMUX_MUXPOS_DAC_gc   = (OPAMP_OP1INMUX_MUXPOS_DAC_gv << OPAMP_MUXPOS_gp),  /* DAC output */
    OPAMP_OP1INMUX_MUXPOS_GND_gc   = (OPAMP_OP1INMUX_MUXPOS_GND_gv << OPAMP_MUXPOS_gp),  /* Ground */
    OPAMP_OP1INMUX_MUXPOS_VDDDIV2_gc = (OPAMP_OP1INMUX_MUXPOS_VDDDIV2_gv << OPAMP_MUXPOS_gp),  /* VDD/2 */
    OPAMP_OP1INMUX_MUXPOS_LINKOUT_gc = (OPAMP_OP1INMUX_MUXPOS_LINKOUT_gv << OPAMP_MUXPOS_gp)   /* Output from OP0 */
} OPAMP_OP1INMUX_MUXPOS_t;

/* Multiplexer Bottom select bit group values */
typedef enum OPAMP_OP1RESMUX_MUXBOT_VALUES_enum
{
    OPAMP_OP1RESMUX_MUXBOT_OFF_gv  = 0x00,  /* Multiplexer off */
    OPAMP_OP1RESMUX_MUXBOT_INP_gv  = 0x01,  /* Positive input pin for OPn */
    OPAMP_OP1RESMUX_MUXBOT_INN_gv  = 0x02,  /* Negative input pin for OPn */
    OPAMP_OP1RESMUX_MUXBOT_DAC_gv  = 0x03,  /* DAC output */
    OPAMP_OP1RESMUX_MUXBOT_LINKOUT_gv = 0x04,  /* Link OP[n-1] output */
    OPAMP_OP1RESMUX_MUXBOT_GND_gv  = 0x05   /* Ground */
} OPAMP_OP1RESMUX_MUXBOT_values_t;

/* Multiplexer Bottom select bit group configurations*/
typedef enum OPAMP_OP1RESMUX_MUXBOT_enum
{
    OPAMP_OP1RESMUX_MUXBOT_OFF_gc  = (OPAMP_OP1RESMUX_MUXBOT_OFF_gv << OPAMP_MUXBOT_gp),  /* Multiplexer off */
    OPAMP_OP1RESMUX_MUXBOT_INP_gc  = (OPAMP_OP1RESMUX_MUXBOT_INP_gv << OPAMP_MUXBOT_gp),  /* Positive input pin for OPn */
    OPAMP_OP1RESMUX_MUXBOT_INN_gc  = (OPAMP_OP1RESMUX_MUXBOT_INN_gv << OPAMP_MUXBOT_gp),  /* Negative input pin for OPn */
    OPAMP_OP1RESMUX_MUXBOT_DAC_gc  = (OPAMP_OP1RESMUX_MUXBOT_DAC_gv << OPAMP_MUXBOT_gp),  /* DAC output */
    OPAMP_OP1RESMUX_MUXBOT_LINKOUT_gc = (OPAMP_OP1RESMUX_MUXBOT_LINKOUT_gv << OPAMP_MUXBOT_gp),  /* Link OP[n-1] output */
    OPAMP_OP1RESMUX_MUXBOT_GND_gc  = (OPAMP_OP1RESMUX_MUXBOT_GND_gv << OPAMP_MUXBOT_gp)   /* Ground */
} OPAMP_OP1RESMUX_MUXBOT_t;

/* Multiplexer Top select bit group values */
typedef enum OPAMP_OP1RESMUX_MUXTOP_VALUES_enum
{
    OPAMP_OP1RESMUX_MUXTOP_OFF_gv  = 0x00,  /* Multiplexer off */
    OPAMP_OP1RESMUX_MUXTOP_OUT_gv  = 0x01,  /* OPn output */
    OPAMP_OP1RESMUX_MUXTOP_VDD_gv  = 0x02   /* VDD */
} OPAMP_OP1RESMUX_MUXTOP_values_t;

/* Multiplexer Top select bit group configurations*/
typedef enum OPAMP_OP1RESMUX_MUXTOP_enum
{
    OPAMP_OP1RESMUX_MUXTOP_OFF_gc  = (OPAMP_OP1RESMUX_MUXTOP_OFF_gv << OPAMP_MUXTOP_gp),  /* Multiplexer off */
    OPAMP_OP1RESMUX_MUXTOP_OUT_gc  = (OPAMP_OP1RESMUX_MUXTOP_OUT_gv << OPAMP_MUXTOP_gp),  /* OPn output */
    OPAMP_OP1RESMUX_MUXTOP_VDD_gc  = (OPAMP_OP1RESMUX_MUXTOP_VDD_gv << OPAMP_MUXTOP_gp)   /* VDD */
} OPAMP_OP1RESMUX_MUXTOP_t;

/* Multiplexer Wiper selector bit group values */
typedef enum OPAMP_OP1RESMUX_MUXWIP_VALUES_enum
{
    OPAMP_OP1RESMUX_MUXWIP_WIP0_gv = 0x00,  /* R1 = 15R, R2 = 1R, R2/R1 = 0.07 */
    OPAMP_OP1RESMUX_MUXWIP_WIP1_gv = 0x01,  /* R1 = 14R, R2 = 2R, R2/R1 = 0.14 */
    OPAMP_OP1RESMUX_MUXWIP_WIP2_gv = 0x02,  /* R1 = 12R, R2 = 4R, R2/R1 = 0.33 */
    OPAMP_OP1RESMUX_MUXWIP_WIP3_gv = 0x03,  /* R1 = 8R, R2 = 8R, R2/R1 = 1 */
    OPAMP_OP1RESMUX_MUXWIP_WIP4_gv = 0x04,  /* R1 = 6R, R2 = 10R, R2/R1 = 1.67 */
    OPAMP_OP1RESMUX_MUXWIP_WIP5_gv = 0x05,  /* R1 = 4R, R2 = 12R, R2/R1 = 3 */
    OPAMP_OP1RESMUX_MUXWIP_WIP6_gv = 0x06,  /* R1 = 2R, R2 = 14R, R2/R1 = 7 */
    OPAMP_OP1RESMUX_MUXWIP_WIP7_gv = 0x07   /* R1 = 1R, R2 = 15R, R2/R1 = 15 */
} OPAMP_OP1RESMUX_MUXWIP_values_t;

