avrdudes/avr-libc/include/avr/ioavr32db28.h
/* Event config select bit group values */
typedef enum TCD_CFG_VALUES_enum
{
    TCD_CFG_NEITHER_gv             = 0x00,  /* Neither Filter nor Asynchronous Event is enabled */
    TCD_CFG_FILTER_gv              = 0x01,  /* Input Capture Noise Cancellation Filter enabled */
    TCD_CFG_ASYNC_gv               = 0x02   /* Asynchronous Event output qualification enabled */
} TCD_CFG_values_t;

/* Event config select bit group configurations*/
typedef enum TCD_CFG_enum
{
    TCD_CFG_NEITHER_gc             = (TCD_CFG_NEITHER_gv << TCD_CFG_gp),  /* Neither Filter nor Asynchronous Event is enabled */
    TCD_CFG_FILTER_gc              = (TCD_CFG_FILTER_gv << TCD_CFG_gp),  /* Input Capture Noise Cancellation Filter enabled */
    TCD_CFG_ASYNC_gc               = (TCD_CFG_ASYNC_gv << TCD_CFG_gp)   /* Asynchronous Event output qualification enabled */
} TCD_CFG_t;

/* Clock select bit group values */
typedef enum TCD_CLKSEL_VALUES_enum
{
    TCD_CLKSEL_OSCHF_gv            = 0x00,  /* Internal High-Frequency oscillator */
    TCD_CLKSEL_PLL_gv              = 0x01,  /* PLL */
    TCD_CLKSEL_EXTCLK_gv           = 0x02,  /* External Clock */
    TCD_CLKSEL_CLKPER_gv           = 0x03   /* Peripheral clock */
} TCD_CLKSEL_values_t;

/* Clock select bit group configurations*/
typedef enum TCD_CLKSEL_enum
{
    TCD_CLKSEL_OSCHF_gc            = (TCD_CLKSEL_OSCHF_gv << TCD_CLKSEL_gp),  /* Internal High-Frequency oscillator */
    TCD_CLKSEL_PLL_gc              = (TCD_CLKSEL_PLL_gv << TCD_CLKSEL_gp),  /* PLL */
    TCD_CLKSEL_EXTCLK_gc           = (TCD_CLKSEL_EXTCLK_gv << TCD_CLKSEL_gp),  /* External Clock */
    TCD_CLKSEL_CLKPER_gc           = (TCD_CLKSEL_CLKPER_gv << TCD_CLKSEL_gp)   /* Peripheral clock */
} TCD_CLKSEL_t;

/* Compare C output select bit group values */
typedef enum TCD_CMPCSEL_VALUES_enum
{
    TCD_CMPCSEL_PWMA_gv            = 0x00,  /* PWM A output */
    TCD_CMPCSEL_PWMB_gv            = 0x01   /* PWM B output */
} TCD_CMPCSEL_values_t;

/* Compare C output select bit group configurations*/
typedef enum TCD_CMPCSEL_enum
{
    TCD_CMPCSEL_PWMA_gc            = (TCD_CMPCSEL_PWMA_gv << TCD_CMPCSEL_bp),  /* PWM A output */
    TCD_CMPCSEL_PWMB_gc            = (TCD_CMPCSEL_PWMB_gv << TCD_CMPCSEL_bp)   /* PWM B output */
} TCD_CMPCSEL_t;

/* Compare D output select bit group values */
typedef enum TCD_CMPDSEL_VALUES_enum
{
    TCD_CMPDSEL_PWMA_gv            = 0x00,  /* PWM A output */
    TCD_CMPDSEL_PWMB_gv            = 0x01   /* PWM B output */
} TCD_CMPDSEL_values_t;

/* Compare D output select bit group configurations*/
typedef enum TCD_CMPDSEL_enum
{
    TCD_CMPDSEL_PWMA_gc            = (TCD_CMPDSEL_PWMA_gv << TCD_CMPDSEL_bp),  /* PWM A output */
    TCD_CMPDSEL_PWMB_gc            = (TCD_CMPDSEL_PWMB_gv << TCD_CMPDSEL_bp)   /* PWM B output */
} TCD_CMPDSEL_t;

/* Counter prescaler select bit group values */
typedef enum TCD_CNTPRES_VALUES_enum
{
    TCD_CNTPRES_DIV1_gv            = 0x00,  /* Sync clock divided by 1 */
    TCD_CNTPRES_DIV4_gv            = 0x01,  /* Sync clock divided by 4 */
    TCD_CNTPRES_DIV32_gv           = 0x02   /* Sync clock divided by 32 */
} TCD_CNTPRES_values_t;

/* Counter prescaler select bit group configurations*/
typedef enum TCD_CNTPRES_enum
{
    TCD_CNTPRES_DIV1_gc            = (TCD_CNTPRES_DIV1_gv << TCD_CNTPRES_gp),  /* Sync clock divided by 1 */
    TCD_CNTPRES_DIV4_gc            = (TCD_CNTPRES_DIV4_gv << TCD_CNTPRES_gp),  /* Sync clock divided by 4 */
    TCD_CNTPRES_DIV32_gc           = (TCD_CNTPRES_DIV32_gv << TCD_CNTPRES_gp)   /* Sync clock divided by 32 */
} TCD_CNTPRES_t;

/* Dither select bit group values */
typedef enum TCD_DITHERSEL_VALUES_enum
{
    TCD_DITHERSEL_ONTIMEB_gv       = 0x00,  /* On-time ramp B */
    TCD_DITHERSEL_ONTIMEAB_gv      = 0x01,  /* On-time ramp A and B */
    TCD_DITHERSEL_DEADTIMEB_gv     = 0x02,  /* Dead-time rampB */
    TCD_DITHERSEL_DEADTIMEAB_gv    = 0x03   /* Dead-time ramp A and B */
} TCD_DITHERSEL_values_t;

/* Dither select bit group configurations*/
typedef enum TCD_DITHERSEL_enum
{
    TCD_DITHERSEL_ONTIMEB_gc       = (TCD_DITHERSEL_ONTIMEB_gv << TCD_DITHERSEL_gp),  /* On-time ramp B */
    TCD_DITHERSEL_ONTIMEAB_gc      = (TCD_DITHERSEL_ONTIMEAB_gv << TCD_DITHERSEL_gp),  /* On-time ramp A and B */
    TCD_DITHERSEL_DEADTIMEB_gc     = (TCD_DITHERSEL_DEADTIMEB_gv << TCD_DITHERSEL_gp),  /* Dead-time rampB */
    TCD_DITHERSEL_DEADTIMEAB_gc    = (TCD_DITHERSEL_DEADTIMEAB_gv << TCD_DITHERSEL_gp)   /* Dead-time ramp A and B */
} TCD_DITHERSEL_t;

/* Delay prescaler select bit group values */
typedef enum TCD_DLYPRESC_VALUES_enum
{
    TCD_DLYPRESC_DIV1_gv           = 0x00,  /* No prescaling */
    TCD_DLYPRESC_DIV2_gv           = 0x01,  /* Prescale with 2 */
    TCD_DLYPRESC_DIV4_gv           = 0x02,  /* Prescale with 4 */
    TCD_DLYPRESC_DIV8_gv           = 0x03   /* Prescale with 8 */
} TCD_DLYPRESC_values_t;

/* Delay prescaler select bit group configurations*/
typedef enum TCD_DLYPRESC_enum
{
    TCD_DLYPRESC_DIV1_gc           = (TCD_DLYPRESC_DIV1_gv << TCD_DLYPRESC_gp),  /* No prescaling */
    TCD_DLYPRESC_DIV2_gc           = (TCD_DLYPRESC_DIV2_gv << TCD_DLYPRESC_gp),  /* Prescale with 2 */
    TCD_DLYPRESC_DIV4_gc           = (TCD_DLYPRESC_DIV4_gv << TCD_DLYPRESC_gp),  /* Prescale with 4 */
    TCD_DLYPRESC_DIV8_gc           = (TCD_DLYPRESC_DIV8_gv << TCD_DLYPRESC_gp)   /* Prescale with 8 */
} TCD_DLYPRESC_t;

/* Delay select bit group values */
typedef enum TCD_DLYSEL_VALUES_enum
{
    TCD_DLYSEL_OFF_gv              = 0x00,  /* No delay */
    TCD_DLYSEL_INBLANK_gv          = 0x01,  /* Input blanking enabled */
    TCD_DLYSEL_EVENT_gv            = 0x02   /* Event delay enabled */
} TCD_DLYSEL_values_t;

/* Delay select bit group configurations*/
typedef enum TCD_DLYSEL_enum
{
    TCD_DLYSEL_OFF_gc              = (TCD_DLYSEL_OFF_gv << TCD_DLYSEL_gp),  /* No delay */
    TCD_DLYSEL_INBLANK_gc          = (TCD_DLYSEL_INBLANK_gv << TCD_DLYSEL_gp),  /* Input blanking enabled */
    TCD_DLYSEL_EVENT_gc            = (TCD_DLYSEL_EVENT_gv << TCD_DLYSEL_gp)   /* Event delay enabled */
} TCD_DLYSEL_t;

